УТ_для_edt/src/Catalogs/смартПрограммыОбучения/смартПрограммыОбучения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>смартПрограммыОбучения</name>
  <comment>#4898 смарт: Тимофеева 17.11.2025 / Создание механизма для учета квалификаций инженеров и менеджеров.</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбучения</name>
    <type>
      <types>EnumRef.смартВидыОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьОбучения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаУтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>CatalogRef.CRM_Помещения</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ОценкаОбучения</name>
    <type>
      <types>EnumRef.смартВариантыОценкиОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Преподаватели</name>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборудованиеДИЦ</name>
    <attributes>
      <name>Оборудование</name>
      <type>
        <types>CatalogRef.демоОборудованиеДляДемонстрации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТребуемыеКвалификации</name>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.смартКвалификацииМенеджеров</types>
        <types>CatalogRef.смартУчебныеДисциплины</types>
        <types>CatalogRef.смартОборудованиеКлиентов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Квалификации</name>
    <attributes>
      <name>Квалификация</name>
      <type>
        <types>CatalogRef.смартКвалификацииМенеджеров</types>
        <types>CatalogRef.смартУчебныеДисциплины</types>
        <types>CatalogRef.смартОборудованиеКлиентов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Enums/смартНазначенияСкладов/смартНазначенияСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартНазначенияСкладов</name>
  <comment>//++ #1351 смарт: Фролов 11.05.2023 //Разделение остатков по организациям в заказах</comment>
  <enumValues>
    <name>ГарантийныеЗапчастиНеДляПродажи</name>
  </enumValues>
  <enumValues>
    <name>ДемоЗал</name>
  </enumValues>
  <enumValues>
    <name>СкладДляВнутреннихНужд</name>
  </enumValues>
  <enumValues>
    <name>ТорговыйСклад</name>
  </enumValues>
  <enumValues>
    <name>ФизическоеЛицо</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/смартПрограммыОбучения/Forms/ФормаЭлемента/Module.bsl
/////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.МестоПроведения = Справочники.смартПредопределенныеЗначения.Настройки.СкладДемозалМоскваСмарт;	
		Объект.Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.МестоПроведения, "Подразделение");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		Объект.МестоПроведения = ПолучитьДемоЗалПоПодразделению(Объект.Подразделение);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

/////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДемоЗалПоПодразделению(Подразделение)
	Результат = Справочники.смартПредопределенныеЗначения.Настройки.СкладДемозалМоскваСмарт;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Склады.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	Склады.Подразделение = &Подразделение
	|	И Склады.смартНазначениеСклада = ЗНАЧЕНИЕ(Перечисление.смартНазначенияСкладов.ДемоЗал)";
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	Возврат Результат;
КонецФункции

#КонецОбласти
